org/day4.org
* Specemacs Rocks (Day 4)
** Talk more about load,load-file, requi, provide and auto-load
** Better defaults
   1. Indent-regin or buffer
      #+BEGIN_SRC emacs-lisp
        ;; auto 缩进
        (defun indent-buffer()
          (interactive)
          (indent-region (point-min) (point-max)))

        (defun indent-region-or-buffer()
          (interactive)
          (save-excursion
            (if (region-active-p)
         	(progn
        	  (indent-region (region-beginning) (region-end))
        	  (message "Indent selected region."))
                (progn
	          (indent-buffer)
	          (message "Indent buffer.")))))
        (global-set-key (kbd "C-M-\\") 'indent-region-or-buff)
      #+END_SRC

   2. another way to complete things in Emacs
      #+BEGIN_SRC emacs-lisp
      (global-set-key (kbd "s-/") 'hippie-expand)

(setq hippie-expand-try-functions-list '(try-expand-dabbrev
					 try-expand-all-abbrevs
					 try-expand-dabbrev-from-kill
					 try-complete-file-name
					 try-complete-file-name-partially
					 try-expand-dabbrev-all-buffers
					 try-expand-list
					 try-expand-line
					 try-complete-lisp-symbol
					 try-complete-lisp-symbol-partially
					 ))
      #+END_SRC
** Dired mode and file related operation
   1. copy, delete and rename file
      - +: to create directory
      - C-x C-f: to create file
      - g: to refresh dired buffer
      - c: copy file
      - d: delete file
      - D: delete after confim
      - R: rename files

	#+BEGIN_SRC emacs-lisp
        ;; dired config: let dired-mode on delete or copy directory time no longer ask y or n
        (setq dired-recursive-deletes 'always)
        (setq dired-recursive-copies 'always)

        (put 'dired-find-alternate-file 'disable nil)
        ;; because use require very Waste of performance(浪费性能), so use following
        ;; statement play a(起到) lazy load effect(懒加载效果)
        (with-eval-after-load 'dired
          (define-key dired-mode-map (kbd "RET") 'dired-find-alternate-file))

        ;; from a dired copy file to other a dired
        (setq dired-dwim-target t)

        ;;less typing when emacs ask you yes or no
        (fset 'yes or no 'y or n)
	#+END_SRC
    2. add new file and folder
       + for adding new folder

    3. open dired current buffer
	#+BEGIN_SRC emacs-lisp
	;; open current dired-buffer (C-x C-j)
        (require 'dired-x)
	#+END_SRC
    4. open finder on Mac (optinal)
       Packages:
       M-x reveal-in-osx-finder
**
