org/day4.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>day4</title>
<!-- 2017-05-14 Sun 20:52 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="王亮" />
</head>
<body>
<div id="content">
<h1 class="title">day4</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Specemacs Rocks (Day 4)</a>
<ul>
<li><a href="#sec-1-1">1.1. Talk more about load,load-file, requi, provide and auto-load</a></li>
<li><a href="#sec-1-2">1.2. Better defaults</a></li>
<li><a href="#sec-1-3">1.3. Dired mode and file related operation</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Specemacs Rocks (Day 4)</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Talk more about load,load-file, requi, provide and auto-load</h3>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Better defaults</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>Indent-regin or buffer
<div class="org-src-container">

<pre class="src src-emacs-lisp">;; auto 缩进
(defun indent-buffer()
  (interactive)
  (indent-region (point-min) (point-max)))

(defun indent-region-or-buffer()
  (interactive)
  (save-excursion
    (if (region-active-p)
	(progn
	  (indent-region (region-beginning) (region-end))
	  (message "Indent selected region."))
	(progn
	  (indent-buffer)
	  (message "Indent buffer.")))))
(global-set-key (kbd "C-M-\\") 'indent-region-or-buff)
</pre>
</div>
</li>

<li>another way to complete things in Emacs
<div class="org-src-container">

<pre class="src src-emacs-lisp">      (global-set-key (kbd "s-/") 'hippie-expand)

(setq hippie-expand-try-functions-list '(try-expand-dabbrev
					 try-expand-all-abbrevs
					 try-expand-dabbrev-from-kill
					 try-complete-file-name
					 try-complete-file-name-partially
					 try-expand-dabbrev-all-buffers
					 try-expand-list
					 try-expand-line
					 try-complete-lisp-symbol
					 try-complete-lisp-symbol-partially
					 ))
</pre>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Dired mode and file related operation</h3>
<div class="outline-text-3" id="text-1-3">
<ol class="org-ol">
<li>copy, delete and rename file
<ul class="org-ul">
<li>+: to create directory
</li>
<li>C-x C-f: to create file
</li>
<li>g: to refresh dired buffer
</li>
<li>c: copy file
</li>
<li>d: delete file
</li>
<li>D: delete after confim
</li>
<li>R: rename files

<div class="org-src-container">

<pre class="src src-emacs-lisp">;; dired config: let dired-mode on delete or copy directory time no longer ask y or n
(setq dired-recursive-deletes 'always)
(setq dired-recursive-copies 'always)

(put 'dired-find-alternate-file 'disable nil)
;; because use require very Waste of performance(浪费性能), so use following
;; statement play a(起到) lazy load effect(懒加载效果)
(with-eval-after-load 'dired
  (define-key dired-mode-map (kbd "RET") 'dired-find-alternate-file))

;; from a dired copy file to other a dired
(setq dired-dwim-target t)

;;less typing when emacs ask you yes or no
(fset 'yes or no 'y or n)
</pre>
</div>
</li>
<li>add new file and folder
<ul class="org-ul">
<li>for adding new folder
</li>
</ul>
</li>

<li>open dired current buffer
<div class="org-src-container">

<pre class="src src-emacs-lisp">;; open current dired-buffer (C-x C-j)
(require 'dired-x)
</pre>
</div>
</li>
<li>open finder on Mac (optinal)
Packages:
M-x reveal-in-osx-finder
</li>
</ul>
</li>
</ol>
<p>
**
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 王亮</p>
<p class="date">Created: 2017-05-14 Sun 20:52</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
